//
// Created by robicu on 3/28/25.
//

#ifndef QUALITYTOOLS_H
#define QUALITYTOOLS_H
#include <string>

using namespace std;

class QualityTools {
public:
   // string curses = "𓀀𓀁𓇡𓀬𓇬𓐥𓐬𓁑𓃘𓐭𓐮𓐪𓂈𓇱𓐨𓅬𓎤𓇸𓇣𓀈𓃷𓃾𓂵𓄊𓐩𓀎𓆁𓍄𓇚𓇺𓁽𓃕𓇷𓇃𓎩𓆨𓍔𓆏𓅲𓇽𓇧𓃣𓁺𓅯𓁒𓇼𓃢𓐓𓍎𓂱𓇊𓐍𓃳𓆭𓇅𓃗𓃹𓇺𓆩𓌲𓆃𓆺𓆯𓌮𓅴𓃄𓃖𓅻𓃤𓋼𓁹𓆻𓄋𓋲𓋿𓋼𓃓𓁄𓌾𓇆𓌂𓂔𓌬𓄅𓅰𓋴𓆪𓋼𓃁𓆂𓐧𓌝𓋊𓋹𓌁𓋑𓅵𓋳𓂼𓐍𓁻𓌿𓂛𓃨𓄗𓌚𓌁𓁏𓐨𓄆𓌽𓃸𓃒𓃠𓋹𓁾𓋆𓋴𓌖𓋻𓂉𓂾𓐒𓁋𓃞𓂕𓁜𓅗𓅈𓂞𓀪𓅰𓅢𓂀𓂯𓅀𓅙𓁧𓂿𓐕𓅁𓄳𓅞𓂀𓅪𓁹𓂎𓅚𓄳𓀮𓄻𓁇𓅫𓅩𓅃𓂶𓊛𓊘𓅑𓅝𓂛𓀜𓉫𓊚𓉩𓅠𓈬𓋄𓉴𓅘𓄲𓁚𓉪𓈮𓁕𓄶𓈭𓅢𓊷𓊎𓊍𓁛𓈄𓉡𓈣𓈏𓈋𓐐𓈥𓈉𓉯𓈔𓀶𓁓𓁃𓄸𓅄𓌮𓊛𓉧𓁿𓈄𓉰𓊝𓅜𓈅𓂏𓈪𓄿𓌺𓁝𓀂𓈖𓌗𓈏𓁹𓀝𓀿𓁤𓐡𓅇𓄬𓀾𓀳𓌟𓁀𓈍𓐮𓌤𓀫𓄩𓀌𓀘𓀃𓌘𓂒𓀤𓂙𓄨𓄦𓀑𓀗𓁖𓂚𓀍𓐤𓀙𓐣𓀒𓀄";
    string curses = "!@#$%^&*?/><:;[]{}";
    string curse(string s, int n);
    bool isStringAnInt(string s);
    void Clear();
};



#endif //QUALITYTOOLS_H
